### Q1. 
####    A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.

In [75]:
import scipy.stats as st
import numpy as np
import pandas as pd

import scipy

In [76]:
#Using 2 Sample T Test
df = pd.read_csv("Cutlets.csv")

In [77]:
df

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [78]:
t, p = stats.ttest_ind(df['Unit A'],df['Unit B'])

In [79]:
if p < 0.05:
    print('Reject Null Hypothesis. There is a significant difference in diameters from Unit A and Unit B')
else:
    print('Fail to reject Null Hypothesis. Unit A and Unit B dont have significant difference in diameters.')

Fail to reject Null Hypothesis. Unit A and Unit B dont have significant difference in diameters.

### Q2. 
#### A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch. Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.

In [80]:
#Using Anova Test
df = pd.read_csv("LabTAT.csv")

In [81]:
df

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [82]:
df.iloc[:,0]

0      185.35
1      170.49
2      192.77
3      177.33
4      193.41
        ...
115    178.49
116    176.08
117    202.48
118    182.40
119    182.09
Name: Laboratory 1, Length: 120, dtype: float64

In [83]:
st, pvalue = st.f_oneway(df.iloc[:,0],df.iloc[:,1],df.iloc[:,2],df.iloc[:,3])

In [84]:
pvalue

2.1156708949992414e-57

In [85]:
if pvalue < 0.05:
    print('Reject Null Hypothesis. There is difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list.')
else:
    print('Fail to reject Null hypothesis. There is no difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list.')

Reject Null Hypothesis. There is difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list.

### Q3.
#### Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions

In [134]:
#Using Chi2 Test
df = pd.read_csv("BuyerRatio.csv", index_col=0)

In [87]:
df

                 East  West  North  South
Observed Values
Males              50   142    131     70
Females           435  1523   1356    750

In [109]:
Males = df.iloc[0,:]
Females = df.iloc[1,:]

In [110]:
Females

East      435
West     1523
North    1356
South     750
Name: Females, dtype: int64

In [111]:
Males

East      50
West     142
North    131
South     70
Name: Males, dtype: int64

In [113]:
obs = pd.crosstab(index=Males, columns=Females)
obs

Females  435   750   1356  1523
Males
50          1     0     0     0
70          0     1     0     0
131         0     0     1     0
142         0     0     0     1

In [114]:
from scipy.stats import chi2_contingency
test,p,df,exp = chi2_contingency(obs)
if p < 0.05:
    print('Reject Ho. Not all proportions are equal.')
else:
    print('Fail to reject Ho. All Proportions are equal.')

Fail to reject Ho. All Proportions are equal.

### Q4
#### TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences

In [139]:
#Using Chi2 Test
df = pd.read_csv("Costomer+OrderForm.csv" )

In [140]:
import pandas as pd
import scipy.stats as st

In [141]:
df

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [146]:
print(df['Phillippines'].value_counts(), df['Indonesia'].value_counts(), df['Malta'].value_counts(), df['India'].value_counts())

Error Free    271
Defective      29
Name: Phillippines, dtype: int64 Error Free    267
Defective      33
Name: Indonesia, dtype: int64 Error Free    269
Defective      31
Name: Malta, dtype: int64 Error Free    280
Defective      20
Name: India, dtype: int64

In [147]:
Error_Free = 271, 267, 269, 280
Defective = 29, 33, 31, 20

In [149]:
obs = (Error_Free, Defective)
obs

((271, 267, 269, 280), (29, 33, 31, 20))

In [150]:
test,p,df,exp = chi2_contingency(obs)

In [152]:
if p < 0.05:
    print('Reject Ho. The defective % vary by centre.')
else:
    print('Fail to reject Ho. The defective %  doesnt varyby centre.')

Fail to reject Ho. The defective %  doesnt varyby centre.